### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_cluster.default[0] will be created
+   resource "aws_ecs_cluster" "default" {
+       arn                = (known after apply)
+       capacity_providers = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-prod"
+       tags_all           = (known after apply)

+       configuration {
+           execute_command_configuration {
+               logging = "DEFAULT"
            }
        }

+       default_capacity_provider_strategy {
+           base              = (known after apply)
+           capacity_provider = (known after apply)
+           weight            = (known after apply)
        }

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.default[0] will be created
+   resource "aws_ecs_cluster_capacity_providers" "default" {
+       capacity_providers = [
+           "FARGATE",
        ]
+       cluster_name       = "gost-prod"
+       id                 = (known after apply)
    }

  # aws_ssm_parameter.deploy_api_cluster_name will be created
+   resource "aws_ssm_parameter" "deploy_api_cluster_name" {
+       arn            = (known after apply)
+       data_type      = (known after apply)
+       description    = "Name of the ECS cluster to specify when forcing new deployments for the API."
+       id             = (known after apply)
+       insecure_value = (known after apply)
+       key_id         = (known after apply)
+       name           = "/gost/prod/deploy-config/api/cluster-name"
+       tags_all       = (known after apply)
+       tier           = (known after apply)
+       type           = "String"
+       value          = (sensitive value)
+       version        = (known after apply)
    }

  # aws_ssm_parameter.deploy_api_service_name will be created
+   resource "aws_ssm_parameter" "deploy_api_service_name" {
+       arn            = (known after apply)
+       data_type      = (known after apply)
+       description    = "Name of the ECS service to specify when forcing new deployments for the API."
+       id             = (known after apply)
+       insecure_value = (known after apply)
+       key_id         = (known after apply)
+       name           = "/gost/prod/deploy-config/api/service-name"
+       tags_all       = (known after apply)
+       tier           = (known after apply)
+       type           = "String"
+       value          = (sensitive value)
+       version        = (known after apply)
    }

  # aws_ssm_parameter.deploy_website_cloudfront_distribution_id will be created
+   resource "aws_ssm_parameter" "deploy_website_cloudfront_distribution_id" {
+       arn            = (known after apply)
+       data_type      = (known after apply)
+       description    = "Base URI for deploying website dist artifacts to the origin bucket."
+       id             = (known after apply)
+       insecure_value = (known after apply)
+       key_id         = (known after apply)
+       name           = "/gost/prod/deploy-config/website/distribution-id"
+       tags_all       = (known after apply)
+       tier           = (known after apply)
+       type           = "String"
+       value          = (sensitive value)
+       version        = (known after apply)
    }

  # aws_ssm_parameter.deploy_website_s3_uri will be created
+   resource "aws_ssm_parameter" "deploy_website_s3_uri" {
+       arn            = (known after apply)
+       data_type      = (known after apply)
+       description    = "Base URI for deploying website dist artifacts to the origin bucket."
+       id             = (known after apply)
+       insecure_value = (known after apply)
+       key_id         = (known after apply)
+       name           = "/gost/prod/deploy-config/website/s3-uri"
+       tags_all       = (known after apply)
+       tier           = (known after apply)
+       type           = "String"
+       value          = (sensitive value)
+       version        = (known after apply)
    }

  # module.api.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.api.data.aws_ecs_cluster.default[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_cluster" "default" {
+       arn                                  = (known after apply)
+       cluster_name                         = "gost-prod"
+       id                                   = (known after apply)
+       pending_tasks_count                  = (known after apply)
+       registered_container_instances_count = (known after apply)
+       running_tasks_count                  = (known after apply)
+       service_connect_defaults             = (known after apply)
+       setting                              = (known after apply)
+       status                               = (known after apply)
    }

  # module.api.data.aws_kms_key.ssm will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "ssm" {
+       arn                        = (known after apply)
+       aws_account_id             = (known after apply)
+       creation_date              = (known after apply)
+       customer_master_key_spec   = (known after apply)
+       deletion_date              = (known after apply)
+       description                = (known after apply)
+       enabled                    = (known after apply)
+       expiration_model           = (known after apply)
+       id                         = (known after apply)
+       key_id                     = "alias/aws/ssm"
+       key_manager                = (known after apply)
+       key_state                  = (known after apply)
+       key_usage                  = (known after apply)
+       multi_region               = (known after apply)
+       multi_region_configuration = (known after apply)
+       origin                     = (known after apply)
+       valid_to                   = (known after apply)
    }

  # module.api.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.api.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.api.data.aws_ses_domain_identity.notifications will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ses_domain_identity" "notifications" {
+       arn                = (known after apply)
+       domain             = "grants.usdigitalresponse.org"
+       id                 = (known after apply)
+       verification_token = (known after apply)
    }

  # module.api.data.aws_ssm_parameter.datadog_api_key[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "datadog_api_key" {
+       arn     = (known after apply)
+       id      = (known after apply)
+       name    = "/gost/prod/datadog/api_key"
+       type    = (known after apply)
+       value   = (sensitive value)
+       version = (known after apply)
    }

  # module.api.aws_appautoscaling_policy.average_cpu_target_tracking[0] will be created
+   resource "aws_appautoscaling_policy" "average_cpu_target_tracking" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-prod-api-CPU-TargetTrackingScaling"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "service/gost-prod/gost-prod-api"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in = false
+           target_value     = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.api.aws_appautoscaling_target.desired_count[0] will be created
+   resource "aws_appautoscaling_target" "desired_count" {
+       id                 = (known after apply)
+       max_capacity       = 5
+       min_capacity       = 1
+       resource_id        = "service/gost-prod/gost-prod-api"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
    }

  # module.api.aws_cloudwatch_log_group.default[0] will be created
+   resource "aws_cloudwatch_log_group" "default" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = "gost-prod-api-"
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = (known after apply)
    }

  # module.api.aws_ecs_service.default[0] will be created
+   resource "aws_ecs_service" "default" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 3
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "gost-prod-api"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (sensitive value)
        }

+       service_registries {
+           port         = 3000
+           registry_arn = (known after apply)
        }
    }

  # module.api.aws_ecs_task_definition.default[0] will be created
+   resource "aws_ecs_task_definition" "default" {
+       arn                      = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "gost-prod-api"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
+       task_role_arn            = (known after apply)

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = (known after apply)
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = (known after apply)
                }
            }
        }
    }

  # module.api.aws_iam_role.execution[0] will be created
+   resource "aws_iam_role" "execution" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-prod-api-ECSTaskExecution-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::729134339726:policy/service-management-boundary"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.api.aws_iam_role.task[0] will be created
+   resource "aws_iam_role" "task" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-prod-api-ECSTask-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::729134339726:policy/service-management-boundary"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.api.aws_iam_role_policy.execution["decrypt-secrets"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "decrypt-secrets"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.api.aws_iam_role_policy.execution["write-api-logs"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "write-api-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.api.aws_iam_role_policy.task["connect-to-postgres"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "connect-to-postgres"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.api.aws_iam_role_policy.task["ecs-exec"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "ecs-exec"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.api.aws_iam_role_policy.task["send-emails"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "send-emails"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.api.aws_route53_record.alias[0] will be created
+   resource "aws_route53_record" "alias" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api.grants.usdigitalresponse.org"
+       type            = "A"
+       zone_id         = (sensitive value)

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.api.aws_service_discovery_private_dns_namespace.default[0] will be created
+   resource "aws_service_discovery_private_dns_namespace" "default" {
+       arn         = (known after apply)
+       description = "Private DNS service discovery namespace for gost-prod"
+       hosted_zone = (known after apply)
+       id          = (known after apply)
+       name        = "gost-prod.local"
+       tags_all    = (known after apply)
+       vpc         = (sensitive value)
    }

  # module.api.aws_service_discovery_service.default[0] will be created
+   resource "aws_service_discovery_service" "default" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "gost-prod-api"
+       namespace_id  = (known after apply)
+       tags_all      = (known after apply)
+       type          = (known after apply)

+       dns_config {
+           namespace_id   = (known after apply)
+           routing_policy = "MULTIVALUE"

+           dns_records {
+               ttl  = 60
+               type = "SRV"
            }
        }

+       health_check_custom_config {
+           failure_threshold = 1
        }
    }

  # module.api.aws_ssm_parameter.cookie_secret[0] will be created
+   resource "aws_ssm_parameter" "cookie_secret" {
+       arn            = (known after apply)
+       data_type      = (known after apply)
+       description    = "Secret value used to sign cookies."
+       id             = (known after apply)
+       insecure_value = (known after apply)
+       key_id         = (known after apply)
+       name           = "/gost/prod/api/cookie_secret"
+       tags_all       = (known after apply)
+       tier           = (known after apply)
+       type           = "SecureString"
+       value          = (sensitive value)
+       version        = (known after apply)
    }

  # module.api.aws_ssm_parameter.postgres_connection_string[0] will be created
+   resource "aws_ssm_parameter" "postgres_connection_string" {
+       arn            = (known after apply)
+       data_type      = (known after apply)
+       description    = "Connection string for the postgres database."
+       id             = (known after apply)
+       insecure_value = (known after apply)
+       key_id         = (known after apply)
+       name           = "/gost/prod/postgres/connection_string"
+       tags_all       = (known after apply)
+       tier           = (known after apply)
+       type           = "SecureString"
+       value          = (sensitive value)
+       version        = (known after apply)
    }

  # module.api.random_password.cookie_secret will be created
+   resource "random_password" "cookie_secret" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

  # module.api_to_postgres_security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Attributes" = "api-postgres"
+           "Name"       = "gost-prod-api-postgres"
+           "Namespace"  = "gost-prod"
        }
+       tags_all               = {
+           "Attributes" = "api-postgres"
+           "Name"       = "gost-prod-api-postgres"
+           "Namespace"  = "gost-prod"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.api_to_postgres_security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.api_to_postgres_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
+   resource "null_resource" "sync_rules_and_sg_lifecycles" {
+       id       = (known after apply)
+       triggers = {
+           "sg_ids" = (known after apply)
        }
    }

  # module.api_to_postgres_security_group.random_id.rule_change_forces_new_security_group[0] will be created
+   resource "random_id" "rule_change_forces_new_security_group" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 3
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       keepers     = {
+           "rules" = jsonencode(
                {
+                   _allow_all_egress_ = {
+                       cidr_blocks              = [
+                           "0.0.0.0/0",
                        ]
+                       description              = "Allow all egress"
+                       from_port                = 0
+                       ipv6_cidr_blocks         = [
+                           "::/0",
                        ]
+                       key                      = "_allow_all_egress_"
+                       prefix_list_ids          = []
+                       protocol                 = "-1"
+                       security_groups          = []
+                       self                     = null
+                       source_security_group_id = null
+                       to_port                  = 0
+                       type                     = "egress"
                    }
                }
            )
        }
    }

  # module.postgres.aws_db_parameter_group.postgres13 will be created
+   resource "aws_db_parameter_group" "postgres13" {
+       arn         = (known after apply)
+       description = "RDS Aurora database instance parameter group for gost-prod cluster members."
+       family      = "aurora-postgresql13"
+       id          = (known after apply)
+       name        = "gost-prod-aurora-postgres13-db"
+       name_prefix = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.postgres.aws_rds_cluster_parameter_group.postgres13 will be created
+   resource "aws_rds_cluster_parameter_group" "postgres13" {
+       arn         = (known after apply)
+       description = "RDS Aurora cluster parameter group for gost-prod."
+       family      = "aurora-postgresql13"
+       id          = (known after apply)
+       name        = "gost-prod-aurora-postgres13-cluster"
+       name_prefix = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.website.aws_cloudfront_function.arpa_reporter_uri_rewriter[0] will be created
+   resource "aws_cloudfront_function" "arpa_reporter_uri_rewriter" {
+       arn             = (known after apply)
+       code            = <<-EOT
            var regex = /^\/arpa_reporter((\/.*$)|$)/g;
            
            function handler(event) {
              var request = event.request;
            
              if (request.uri.match(regex).length > 0) {
                  request.uri = /arpa_reporter/index.html;
              }
            
              return request;
            }
        EOT
+       comment         = "Rewrites nested `/arpa_reporter` and `/arpa_reporter/*` URIs to be SPA-friendly."
+       etag            = (known after apply)
+       id              = (known after apply)
+       live_stage_etag = (known after apply)
+       name            = "gost-prod-arpa_reporter_uri_rewriter"
+       publish         = true
+       runtime         = "cloudfront-js-1.0"
+       status          = (known after apply)
    }

  # module.website.aws_cloudfront_origin_access_identity.default will be created
+   resource "aws_cloudfront_origin_access_identity" "default" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "GOST website access."
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

  # module.website.aws_route53_record.alias[0] will be created
+   resource "aws_route53_record" "alias" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "grants.usdigitalresponse.org"
+       type            = "A"
+       zone_id         = (sensitive value)

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.website.aws_s3_object.deploy-config[0] will be created
+   resource "aws_s3_object" "deploy-config" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
            window.apiURLForGOST = https://api.grants.usdigitalresponse.org/;
        EOT
+       content_type           = (known after apply)
+       etag                   = "3e136071dde6f4df1efc2576b9412621"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "/config/deploy-config.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_api.this[0] will be created
+   resource "aws_apigatewayv2_api" "this" {
+       api_endpoint                 = (known after apply)
+       api_key_selection_expression = "$request.header.x-api-key"
+       arn                          = (known after apply)
+       description                  = "API Gateway proxy to ECS web services for GOST"
+       disable_execute_api_endpoint = false
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       name                         = "gost-prod"
+       protocol_type                = "HTTP"
+       route_selection_expression   = "$request.method $request.path"
+       tags_all                     = (known after apply)

+       cors_configuration {
+           allow_credentials = true
+           allow_headers     = [
+               "authorization",
+               "content-type",
+               "x-amz-date",
+               "x-amz-security-token",
+               "x-amz-user-agent",
+               "x-api-key",
            ]
+           allow_methods     = [
+               "DELETE",
+               "GET",
+               "HEAD",
+               "OPTIONS",
+               "PATCH",
+               "POST",
+               "PUT",
            ]
+           allow_origins     = [
+               "https://api.grants.usdigitalresponse.org",
+               "https://grants.usdigitalresponse.org",
            ]
+           max_age           = 86400
        }
    }

  # module.api.module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
+   resource "aws_apigatewayv2_api_mapping" "this" {
+       api_id      = (known after apply)
+       domain_name = (known after apply)
+       id          = (known after apply)
+       stage       = (known after apply)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
+   resource "aws_apigatewayv2_domain_name" "this" {
+       api_mapping_selection_expression = (known after apply)
+       arn                              = (known after apply)
+       domain_name                      = "api.grants.usdigitalresponse.org"
+       id                               = (known after apply)
+       tags_all                         = (known after apply)

+       domain_name_configuration {
+           certificate_arn                        = (known after apply)
+           endpoint_type                          = "REGIONAL"
+           hosted_zone_id                         = (known after apply)
+           ownership_verification_certificate_arn = (known after apply)
+           security_policy                        = "TLS_1_2"
+           target_domain_name                     = (known after apply)
        }
    }

  # module.api.module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be created
+   resource "aws_apigatewayv2_integration" "this" {
+       api_id                                    = (known after apply)
+       connection_id                             = (known after apply)
+       connection_type                           = "VPC_LINK"
+       id                                        = (known after apply)
+       integration_method                        = "ANY"
+       integration_response_selection_expression = (known after apply)
+       integration_type                          = "HTTP_PROXY"
+       integration_uri                           = (known after apply)
+       payload_format_version                    = "1.0"
+       timeout_milliseconds                      = (known after apply)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_route.this["$default"] will be created
+   resource "aws_apigatewayv2_route" "this" {
+       api_id             = (known after apply)
+       api_key_required   = false
+       authorization_type = "NONE"
+       id                 = (known after apply)
+       route_key          = "$default"
+       target             = (known after apply)
    }

  # module.api.module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
+   resource "aws_apigatewayv2_stage" "default" {
+       api_id        = (known after apply)
+       arn           = (known after apply)
+       auto_deploy   = true
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       name          = "$default"
+       tags_all      = (known after apply)

+       access_log_settings {
+           destination_arn = (known after apply)
+           format          = (known after apply)
        }
    }

  # module.api.module.api_gateway.aws_apigatewayv2_vpc_link.this["api-service"] will be created
+   resource "aws_apigatewayv2_vpc_link" "this" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-prod-api"
+       security_group_ids = (known after apply)
+       subnet_ids         = (sensitive value)
+       tags_all           = (known after apply)
    }

  # module.api.module.connect_to_postgres_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.decrypt_secrets_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.ecs_exec_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.efs_data_volume.aws_efs_access_point.default["data"] will be created
+   resource "aws_efs_access_point" "default" {
+       arn             = (known after apply)
+       file_system_arn = (known after apply)
+       file_system_id  = (known after apply)
+       id              = (known after apply)
+       owner_id        = (known after apply)
+       tags            = {
+           "Name" = "gost-prod-datavolume"
        }
+       tags_all        = {
+           "Name" = "gost-prod-datavolume"
        }

+       posix_user {
+           gid = 1000
+           uid = 1000
        }

+       root_directory {
+           path = "/data"

+           creation_info {
+               owner_gid   = 1000
+               owner_uid   = 1000
+               permissions = "0755"
            }
        }
    }

  # module.api.module.efs_data_volume.aws_efs_backup_policy.policy[0] will be created
+   resource "aws_efs_backup_policy" "policy" {
+       file_system_id = (known after apply)
+       id             = (known after apply)

+       backup_policy {
+           status = "DISABLED"
        }
    }

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] will be created
+   resource "aws_efs_file_system" "default" {
+       arn                             = (known after apply)
+       availability_zone_id            = (known after apply)
+       availability_zone_name          = (known after apply)
+       creation_token                  = (known after apply)
+       dns_name                        = (known after apply)
+       encrypted                       = true
+       id                              = (known after apply)
+       kms_key_id                      = (known after apply)
+       number_of_mount_targets         = (known after apply)
+       owner_id                        = (known after apply)
+       performance_mode                = "generalPurpose"
+       provisioned_throughput_in_mibps = 0
+       size_in_bytes                   = (known after apply)
+       tags                            = {
+           "Name" = "gost-prod-datavolume"
        }
+       tags_all                        = {
+           "Name" = "gost-prod-datavolume"
        }
+       throughput_mode                 = "bursting"
    }

  # module.api.module.efs_data_volume.aws_efs_mount_target.default[0] will be created
+   resource "aws_efs_mount_target" "default" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = (sensitive value)
    }

  # module.api.module.efs_data_volume.aws_efs_mount_target.default[1] will be created
+   resource "aws_efs_mount_target" "default" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = (sensitive value)
    }

  # module.api.module.grants_scraper.data.aws_caller_identity.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   (known after apply),
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.trust[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "trust" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"
+           sid     = "AssumeRole"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "aws:SourceAccount"
            }

+           principals {
+               identifiers = [
+                   "scheduler.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.api.module.grants_scraper.aws_iam_role.default[0] will be created
+   resource "aws_iam_role" "default" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       description           = "Executes an ECS task that scrapes grants data daily, between 1:30am - 2:30am ET."
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-prod-grants_scraper-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::729134339726:policy/service-management-boundary"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be created
+   resource "aws_iam_role_policy" "default" {
+       id     = (known after apply)
+       name   = (known after apply)
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be created
+   resource "aws_scheduler_schedule" "default" {
+       arn                          = (known after apply)
+       description                  = "Executes an ECS task that scrapes grants data daily, between 1:30am - 2:30am ET."
+       group_name                   = (known after apply)
+       id                           = (known after apply)
+       name                         = (known after apply)
+       name_prefix                  = "gost-prod-grants_scraper-"
+       schedule_expression          = "cron(30 1 * * ? *)"
+       schedule_expression_timezone = "America/New_York"
+       state                        = "ENABLED"

+       flexible_time_window {
+           maximum_window_in_minutes = 60
+           mode                      = "FLEXIBLE"
        }

+       target {
+           arn      = (known after apply)
+           input    = jsonencode(
                {
+                   containerOverrides = [
+                       {
+                           command     = [
+                               "node",
+                               "-e",
+                               "require(./src/lib/grantscraper).run().then(() => { process.exit(0); }).catch((err) => { console.log(err); process.exit(1); });",
                            ]
+                           environment = [
+                               {
+                                   name  = "ENABLE_GRANTS_SCRAPER"
+                                   value = "true"
                                },
                            ]
+                           name        = "api"
                        },
                    ]
                }
            )
+           role_arn = (known after apply)

+           ecs_parameters {
+               enable_ecs_managed_tags = true
+               enable_execute_command  = false
+               launch_type             = "FARGATE"
+               task_count              = 1
+               task_definition_arn     = (known after apply)

+               network_configuration {
+                   assign_public_ip = false
+                   security_groups  = (known after apply)
+                   subnets          = (sensitive value)
                }
            }

+           retry_policy {
+               maximum_event_age_in_seconds = 14400
+               maximum_retry_attempts       = 10
            }
        }
    }

  # module.api.module.http_security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Attributes" = "api"
+           "Name"       = "gost-prod-api"
        }
+       tags_all               = {
+           "Attributes" = "api"
+           "Name"       = "gost-prod-api"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.api.module.http_security_group.aws_security_group_rule.keyed["HTTP"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       description              = "Managed by Terraform"
+       from_port                = 3000
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 3000
+       type                     = "ingress"
    }

  # module.api.module.http_security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.api.module.http_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
+   resource "null_resource" "sync_rules_and_sg_lifecycles" {
+       id       = (known after apply)
+       triggers = {
+           "sg_ids" = (known after apply)
        }
    }

  # module.api.module.http_security_group.random_id.rule_change_forces_new_security_group[0] will be created
+   resource "random_id" "rule_change_forces_new_security_group" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 3
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       keepers     = {
+           "rules" = jsonencode(
                {
+                   HTTP               = {
+                       cidr_blocks              = []
+                       description              = "Managed by Terraform"
+                       from_port                = 3000
+                       ipv6_cidr_blocks         = []
+                       key                      = "HTTP"
+                       prefix_list_ids          = []
+                       protocol                 = "tcp"
+                       security_groups          = []
+                       self                     = true
+                       source_security_group_id = null
+                       to_port                  = 3000
+                       type                     = "ingress"
                    }
+                   _allow_all_egress_ = {
+                       cidr_blocks              = [
+                           "0.0.0.0/0",
                        ]
+                       description              = "Allow all egress"
+                       from_port                = 0
+                       ipv6_cidr_blocks         = [
+                           "::/0",
                        ]
+                       key                      = "_allow_all_egress_"
+                       prefix_list_ids          = []
+                       protocol                 = "-1"
+                       security_groups          = []
+                       self                     = null
+                       source_security_group_id = null
+                       to_port                  = 0
+                       type                     = "egress"
                    }
                }
            )
        }
    }

  # module.api.module.send_emails_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.ssl_certificate.data.aws_route53_zone.default["grants.usdigitalresponse.org"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "default" {
+       arn                        = (known after apply)
+       caller_reference           = (known after apply)
+       comment                    = (known after apply)
+       id                         = (known after apply)
+       linked_service_description = (known after apply)
+       linked_service_principal   = (known after apply)
+       name                       = (known after apply)
+       name_servers               = (known after apply)
+       primary_name_server        = (known after apply)
+       private_zone               = false
+       resource_record_set_count  = (known after apply)
+       tags                       = (known after apply)
+       vpc_id                     = (known after apply)
+       zone_id                    = (sensitive value)
    }

  # module.api.module.ssl_certificate.aws_acm_certificate.default[0] will be created
+   resource "aws_acm_certificate" "default" {
+       arn                       = (known after apply)
+       domain_name               = "api.grants.usdigitalresponse.org"
+       domain_validation_options = [
+           {
+               domain_name           = "api.grants.usdigitalresponse.org"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "api.grants.usdigitalresponse.org",
        ]
+       tags_all                  = (known after apply)
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.api.module.ssl_certificate.aws_acm_certificate_validation.default[0] will be created
+   resource "aws_acm_certificate_validation" "default" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.api.module.ssl_certificate.aws_route53_record.default["api.grants.usdigitalresponse.org"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.api.module.write_api_logs_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.postgres.module.db.aws_db_subnet_group.this[0] will be created
+   resource "aws_db_subnet_group" "this" {
+       arn                     = (known after apply)
+       description             = "For Aurora cluster gost-prod-postgres"
+       id                      = (known after apply)
+       name                    = "gost-prod-postgres"
+       name_prefix             = (known after apply)
+       subnet_ids              = (sensitive value)
+       supported_network_types = (known after apply)
+       tags_all                = (known after apply)
    }

  # module.postgres.module.db.aws_iam_role.rds_enhanced_monitoring[0] will be created
+   resource "aws_iam_role" "rds_enhanced_monitoring" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "monitoring.rds.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-prod-db-monitoring--"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::729134339726:policy/service-management-boundary"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.postgres.module.db.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0] will be created
+   resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
+       role       = (known after apply)
    }

  # module.postgres.module.db.aws_rds_cluster.this[0] will be created
+   resource "aws_rds_cluster" "this" {
+       allocated_storage                   = (known after apply)
+       allow_major_version_upgrade         = false
+       apply_immediately                   = false
+       arn                                 = (known after apply)
+       availability_zones                  = (known after apply)
+       backtrack_window                    = 0
+       backup_retention_period             = 7
+       cluster_identifier                  = (known after apply)
+       cluster_identifier_prefix           = "gost-prod-postgres-"
+       cluster_members                     = (known after apply)
+       cluster_resource_id                 = (known after apply)
+       copy_tags_to_snapshot               = false
+       database_name                       = "gost"
+       db_cluster_parameter_group_name     = (known after apply)
+       db_subnet_group_name                = "gost-prod-postgres"
+       deletion_protection                 = true
+       enable_global_write_forwarding      = false
+       enable_http_endpoint                = false
+       endpoint                            = (known after apply)
+       engine                              = "aurora-postgresql"
+       engine_mode                         = "provisioned"
+       engine_version                      = "13.6"
+       engine_version_actual               = (known after apply)
+       hosted_zone_id                      = (known after apply)
+       iam_database_authentication_enabled = true
+       iam_roles                           = (known after apply)
+       id                                  = (known after apply)
+       kms_key_id                          = (known after apply)
+       master_password                     = (sensitive value)
+       master_username                     = "postgres"
+       network_type                        = (known after apply)
+       port                                = 5432
+       preferred_backup_window             = "02:00-03:00"
+       preferred_maintenance_window        = "sun:05:00-sun:06:00"
+       reader_endpoint                     = (known after apply)
+       skip_final_snapshot                 = true
+       storage_encrypted                   = true
+       tags_all                            = (known after apply)
+       vpc_security_group_ids              = (known after apply)

+       serverlessv2_scaling_configuration {
+           max_capacity = 1.5
+           min_capacity = 0.5
        }

+       timeouts {}
    }

  # module.postgres.module.db.aws_rds_cluster_instance.this["one"] will be created
+   resource "aws_rds_cluster_instance" "this" {
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       cluster_identifier                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_parameter_group_name               = (known after apply)
+       db_subnet_group_name                  = "gost-prod-postgres"
+       dbi_resource_id                       = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "aurora-postgresql"
+       engine_version                        = "13.6"
+       engine_version_actual                 = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "gost-prod-postgres-one"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.serverless"
+       kms_key_id                            = (known after apply)
+       monitoring_interval                   = 60
+       monitoring_role_arn                   = (known after apply)
+       network_type                          = (known after apply)
+       performance_insights_enabled          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       preferred_backup_window               = (known after apply)
+       preferred_maintenance_window          = "sun:05:00-sun:06:00"
+       promotion_tier                        = 0
+       publicly_accessible                   = false
+       storage_encrypted                     = (known after apply)
+       tags_all                              = (known after apply)
+       writer                                = (known after apply)

+       timeouts {}
    }

  # module.postgres.module.db.aws_security_group.this[0] will be created
+   resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "Control traffic to/from RDS Aurora gost-prod-postgres"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "gost-prod-postgres-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "gost-prod-postgres"
        }
+       tags_all               = {
+           "Name" = "gost-prod-postgres"
        }
+       vpc_id                 = (sensitive value)
    }

  # module.postgres.module.db.aws_security_group_rule.default_ingress[0] will be created
+   resource "aws_security_group_rule" "default_ingress" {
+       description              = "From allowed SGs"
+       from_port                = 5432
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 5432
+       type                     = "ingress"
    }

  # module.postgres.module.db.random_password.master_password[0] will be created
+   resource "random_password" "master_password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

  # module.website.module.cdn.aws_cloudfront_distribution.this[0] will be created
+   resource "aws_cloudfront_distribution" "this" {
+       aliases                        = [
+           "grants.usdigitalresponse.org",
        ]
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       comment                        = "GOST website CDN."
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = false
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_100"
+       retain_on_delete               = false
+       status                         = (known after apply)
+       tags_all                       = (known after apply)
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = (known after apply)
+           max_ttl                = (known after apply)
+           min_ttl                = 0
+           target_origin_id       = "content"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           function_association {
+               event_type   = "viewer-request"
+               function_arn = (known after apply)
            }
        }

+       logging_config {
+           bucket          = (known after apply)
+           include_cookies = false
        }

+       ordered_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = (known after apply)
+           max_ttl                = (known after apply)
+           min_ttl                = 0
+           path_pattern           = "/deploy-config.js"
+           target_origin_id       = "config"
+           viewer_protocol_policy = "redirect-to-https"
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "config"
+           origin_path         = "/config"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }
+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "content"
+           origin_path         = "/dist"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn      = (known after apply)
+           minimum_protocol_version = "TLSv1.2_2021"
+           ssl_support_method       = "sni-only"
        }
    }

  # module.website.module.cloudfront_ssl_certificate.aws_acm_certificate.default[0] will be created
+   resource "aws_acm_certificate" "default" {
+       arn                       = (known after apply)
+       domain_name               = "grants.usdigitalresponse.org"
+       domain_validation_options = [
+           {
+               domain_name           = "grants.usdigitalresponse.org"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "grants.usdigitalresponse.org",
        ]
+       tags                      = {
+           "Name"      = "gost-prod"
+           "Namespace" = "gost-prod"
        }
+       tags_all                  = {
+           "Name"      = "gost-prod"
+           "Namespace" = "gost-prod"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.website.module.cloudfront_ssl_certificate.aws_acm_certificate_validation.default[0] will be created
+   resource "aws_acm_certificate_validation" "default" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.website.module.cloudfront_ssl_certificate.aws_route53_record.default["grants.usdigitalresponse.org"] will be created
+   resource "aws_route53_record" "default" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 300
+       type            = (known after apply)
+       zone_id         = "Z03820991KN71D2RTTZNR"
    }

  # module.website.module.cloudfront_to_origin_bucket_access_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.website.module.github_deploy_to_origin_bucket_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.website.module.logs_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.website.module.logs_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.website.module.logs_bucket.aws_s3_bucket.default[0] will be created
+   resource "aws_s3_bucket" "default" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "gost-prod-logs-729134339726-us-west-2-website"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Attributes" = "729134339726-us-west-2-website"
+           "Name"       = "gost-prod-logs-729134339726-us-west-2-website"
+           "Namespace"  = "gost-prod"
        }
+       tags_all                    = {
+           "Attributes" = "729134339726-us-west-2-website"
+           "Name"       = "gost-prod-logs-729134339726-us-west-2-website"
+           "Namespace"  = "gost-prod"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.website.module.logs_bucket.aws_s3_bucket_acl.default[0] will be created
+   resource "aws_s3_bucket_acl" "default" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # module.website.module.logs_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           id     = "rule-1"
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 7
            }

+           expiration {
+               days                         = 90
+               expired_object_delete_marker = (known after apply)
            }

+           filter {
            }

+           transition {
+               days          = 30
+               storage_class = "STANDARD_IA"
            }
+           transition {
+               days          = 60
+               storage_class = "GLACIER"
            }
        }
    }

  # module.website.module.logs_bucket.aws_s3_bucket_ownership_controls.default[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # module.website.module.logs_bucket.aws_s3_bucket_policy.default[0] will be created
+   resource "aws_s3_bucket_policy" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.website.module.logs_bucket.aws_s3_bucket_public_access_block.default[0] will be created
+   resource "aws_s3_bucket_public_access_block" "default" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.website.module.logs_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           bucket_key_enabled = false

+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.website.module.logs_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
+   resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
+       create_duration  = "30s"
+       destroy_duration = "30s"
+       id               = (known after apply)
    }

  # module.website.module.origin_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = (known after apply)
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.website.module.origin_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.website.module.origin_bucket.aws_s3_bucket.default[0] will be created
+   resource "aws_s3_bucket" "default" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "gost-prod-origin-729134339726-us-west-2-website"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Attributes" = "729134339726-us-west-2-website"
+           "Name"       = "gost-prod-origin-729134339726-us-west-2-website"
+           "Namespace"  = "gost-prod"
        }
+       tags_all                    = {
+           "Attributes" = "729134339726-us-west-2-website"
+           "Name"       = "gost-prod-origin-729134339726-us-west-2-website"
+           "Namespace"  = "gost-prod"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.website.module.origin_bucket.aws_s3_bucket_acl.default[0] will be created
+   resource "aws_s3_bucket_acl" "default" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # module.website.module.origin_bucket.aws_s3_bucket_ownership_controls.default[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # module.website.module.origin_bucket.aws_s3_bucket_policy.default[0] will be created
+   resource "aws_s3_bucket_policy" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.website.module.origin_bucket.aws_s3_bucket_public_access_block.default[0] will be created
+   resource "aws_s3_bucket_public_access_block" "default" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.website.module.origin_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           bucket_key_enabled = false

+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.website.module.origin_bucket.aws_s3_bucket_versioning.default[0] will be created
+   resource "aws_s3_bucket_versioning" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.website.module.origin_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
+   resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
+       create_duration  = "30s"
+       destroy_duration = "30s"
+       id               = (known after apply)
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "EFS Security Group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "gost-prod-datavolume-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "gost-prod-datavolume"
        }
+       tags_all               = {
+           "Name" = "gost-prod-datavolume"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group_rule.keyed["_m[0]#in#sg#0"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       description              = "Allow ingress EFS traffic"
+       from_port                = 2049
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 2049
+       type                     = "ingress"
    }

Plan: 88 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*